/**
 * 注册南区地图
 * @param  {css选择器} id 地图注册的盒子
 * @return {object}    注册的对象
 */
function registNanquMap(selector) {
    // 系列对应的图标
    var paoGreen = "./img/map_pao1.png";
    var paoBlue = "./img/map_pao2.png";
    // 地图填充背景，不能直接用路径
    var mapBg = document.createElement("img");
    mapBg.src = "./img/bg-color.png";


    if (!echarts) {
        console.log("请先引入加载echarts");
    }

    // GeoJSON格式地图
    var nanqu = {
        "type": "FeatureCollection",
        "features": [{
            "id": "310152",
            "type": "Feature",
            "geometry": {
                "type": "Polygon",
                "coordinates": [
                    [[121.49509906768799,31.24316854699421],[121.48827552795409,31.245168212108464],[121.48540019989014,31.24421424871145],[121.48050785064697,31.24025152837923],[121.47655963897705,31.242159525589464],[121.46977901458739,31.23926082231851],[121.46389961242674,31.242196217465768],[121.46677494049072,31.23463738998359],[121.46870613098145,31.22660088585942],[121.46767616271973,31.2245824783588],[121.45707607269287,31.224655875750415],[121.4580202102661,31.220765735452854],[121.45025253295898,31.216838733349253],[121.44042491912842,31.2149302248288],[121.4384937286377,31.21195727904624],[121.435489654541,31.211920575427786],[121.43845081329346,31.204139086677696],[121.42381668090819,31.198247486602355],[121.42179965972899,31.196320248062804],[121.42285108566283,31.193383428138446],[121.4208984375,31.19143773474434],[121.41699314117432,31.19140102316371],[121.41697168350221,31.19340178354604],[121.41504049301147,31.19140102316371],[121.41310930252075,31.191382667368067],[121.41313076019286,31.188500763293852],[121.41398906707765,31.187436088636215],[121.41596317291261,31.18750951485915],[121.41600608825685,31.18369127573975],[121.4003849029541,31.179689302139757],[121.39841079711914,31.18068063246303],[121.39845371246338,31.178697961437084],[121.39450550079346,31.178771394437653],[121.39549255371092,31.174842648928426],[121.3935613632202,31.17381453908375],[121.3945484161377,31.16995902776277],[121.39158725738524,31.168894144595342],[121.39540672302245,31.160264477377133],[121.40330314636229,31.16309215704987],[121.41489028930664,31.136795152889004],[121.42184257507323,31.12797888236273],[121.4364767074585,31.129889143843453],[121.43945932388306,31.120172125614904],[121.43645524978636,31.113246535632744],[121.43937349319458,31.112291242186693],[121.44233465194702,31.113264906566354],[121.44628286361694,31.11616746941805],[121.44726991653442,31.114256931701238],[121.45018815994263,31.116240950869965],[121.45211935043335,31.1151938348096],[121.45020961761476,31.113301648422887],[121.45306348800658,31.10937018913125],[121.45216226577759,31.10937018913125],[121.45214080810548,31.108396484807898],[121.4482355117798,31.108396484807898],[121.4482355117798,31.107422770499024],[121.44626140594484,31.107422770499024],[121.4462184906006,31.106467418453796],[121.44819259643556,31.106467418453796],[121.44920110702516,31.105493684362916],[121.45117521286012,31.105493684362916],[121.45113229751585,31.10450156766139],[121.45209789276122,31.10450156766139],[121.45310640335082,31.10158027496085],[121.45602464675903,31.10154352856844],[121.46286964416504,31.102517303163197],[121.4638352394104,31.109406932495112],[121.46971464157104,31.1191434227195],[121.46973609924315,31.125021574787453],[121.46872758865355,31.12794214618809],[121.4590072631836,31.139641898553467],[121.45795583724976,31.142580385090334],[121.45797729492186,31.146510468486557],[121.46868467330931,31.158152843363986],[121.46969318389891,31.16114584113259],[121.46877050399779,31.167994492590086],[121.4658737182617,31.175760594715126],[121.46580934524536,31.178697961437084],[121.46677494049072,31.181671952406703],[121.46870613098145,31.18460913574325],[121.47651672363283,31.188427337839876],[121.49402618408202,31.192392230842],[121.5019655227661,31.20021139406224],[121.5087890625,31.2110029803363],[121.51076316833496,31.214856819885608],[121.50973320007324,31.218820605267094],[121.50677204132081,31.22362830708091],[121.49507761001585,31.23537128323975],[121.49409055709839,31.239242475811995],[121.49509906768799,31.24316854699421]]
                ],
                "encodeOffsets": []
            },
            "properties": {
                "cp": [
                    121.43177204132081,
                    31.16362830708091
                ],
                "name": "南区",
                "childNum": 0
            }
        }, ]
    };
    echarts.registerMap("南区", nanqu);

    // 初始化echarts
    var myMapChart = echarts.init(document.querySelector("#map"));

    // echarts配置
    var option = {
        // color: ['#9ff575', '#6dabf8', '#e2c90b', '#e07b44'],
        // 配置地图
        geo: {
            map: '南区',
            roam: false,
            center: [121.45677204132081, 31.16962830708091],    // 设置地图中心
            label: {
                emphasis: {
                    show: false
                }
            },
            itemStyle: {
                normal: {
                    color: {
                        image: mapBg,   // 地图填充背景图（HtmlDomElement）
                        repeat: 'repeat'
                    },
                    borderColor: '#a2bcd1',
                    borderWidth: 1,
                    shadowBlur: 30,
                    shadowColor: 'rgba(0,0,0, 0.8)',
                    shadowOffsetY: 20,
                    shadowOffsetX: 10
                },
                emphasis: {
                    color: {
                        image: mapBg,
                        repeat: 'repeat'
                    },
                    borderColor: '#a2bcd1',
                    borderWidth: 1,
                    shadowBlur: 30,
                    shadowColor: 'rgba(0,0,0, 0.8)',
                    shadowOffsetY: 20,
                    shadowOffsetX: 10
                }
            },
            // 不响应鼠标操作
            silent: true
        },
        // 鼠标悬停提示信息
        tooltip: {
            formatter: function(params) {
                return params.seriesName + ":" + params.data.value[2] + 123;
            }
        },
        // 图例
        legend: {
            show: true,
            orient: 'vertical',
            left: '5%',
            bottom: '5%',
            data: ['自营厅', "合作厅"],
            selectedMode: 'multiple',
            inactiveColor: '#aaa',
            textStyle: {
                color: 'blue'
            },
            itemWidth: 15,
            itemHeight: 15,
            data: [{
                name: "自营厅",
                textStyle: {
                    color: '#9ff575'
                }
            }, {
                name: "合作厅",
                textStyle: {
                    color: '#3e5a8b'
                }
            }]
        },
        // 系列列表。每个系列通过 type 决定自己的图表类型
        series: [
            // 设置背景地图
            {
                name: "南区",
                type: 'map',
                mapType: "南区",
                showLegendSymbol: false,
                itemStyle: {
                    normal: {
                        borderColor: '#389BB7',
                        areaColor: '#000',
                    },
                    emphasis: {
                        borderColor: '#389BB7',
                        areaColor: '#000',
                    }
                },
                tooltip: {
                    show: false
                },
                animation: false,
                zlevel: -1,
                // 不响应鼠标操作
                silent: true
            }, 
            //设置第一个系列
            {
                name: '自营厅',
                type: 'scatter',
                coordinateSystem: 'geo',
                data: [{
                    value: [121.44509906768799, 31.17316854699421, 150, "状况", 1]
                }, {
                    value: [121.46509906768799, 31.18316854699421, 190]
                }, {
                    value: [121.46709906768799, 31.20916854699421, 190]
                }],
                symbol: 'image://' + paoGreen,
                symbolSize: function(val){
                    return val[2]/5
                },
                zlevel: 1
            }, 
            //设置第二个系列
            {
                name: '合作厅',
                type: 'scatter',
                coordinateSystem: 'geo',
                data: [{

                    value: [121.43507761001565, 31.15537128323975, 160]
                }, {
                    value: [121.45907761001565, 31.19537128323975, 100]
                }],
                symbol: 'image://' + paoBlue,
                symbolSize: function(val){
                    return val[2]/5
                },
                zlevel: 1
            }, 
            // 设置不动的点
            {
                name: '合作厅',
                type: 'scatter',
                coordinateSystem: 'geo',
                data: [{
                    value: [121.44509906768799, 31.17316854699421, 150, "状况", 2]
                }],
                symbol: 'image://' + paoBlue,
                symbolSize: function(val){
                    return val[2]/5
                },
                label: {
                    normal: {
                        fontSize: 12,
                        color: '#fff',
                        show: true,
                        position: ['50%', '50%'],
                        formatter: function(params) {
                            return [
                                '{a|' + params.data.value[3] + '}',
                                '{b|归属网格：' + '公众一号' + '}',
                                '{b|归属渠道：' + '自营厅' + '}'
                            ].join("\n");
                        },
                        lineHeight: 20,
                        align: 'center',
                        verticalAlign: 'middle',
                        rich: {
                            a: {
                                fontSize: 14,
                                lineHeight: 20,
                                color: '#dec615'
                            },
                            b: {
                                lineHeight: 14,
                                color: '#bfbfc2'
                            }
                        }
                    }
                },
                zlevel: 1
            }
        ]
    };

    // 调用配置
    myMapChart.setOption(option);

    //气泡闪烁
    function bubbleBlur(speed) {
        console.log("必须设置option后再调用")
        var min = 0.5;
        var symbolSize = 3; //圆的缩放比例
        var _speed = 0.01 * (_speed || 1);
        var _scale = 1;


        setInterval(function() {
            //console.log(scale)
            var a = 1;
            var parsent = 0;
            // 缩放比例为1-min,到最小时，会增大。
            _scale >= 1 || _scale <= min ? _speed = -_speed : 0;
            _scale += _speed;

            // 根据系列的格式动态添加变化。
            var length = myMapChart.getOption().series.length;
            var series = [{}]; // series的第一个对象为底层地图,不要更改

            function getSymbolSize(val) {
                if (a % 2 === 0) {
                    parsent = _scale
                } else {
                    parsent = (1 - _scale) + min
                }
                a++;

                // val[4]值为1是，为系列1选中状态
                if (val[4] && +val[4] === 1) {
                    return 0;

                    // val[4]值为2是，为系列2选中状态
                } else if (val[4] && +val[4] === 2) {
                    return val[2] / 10 * symbolSize;

                    // 都不是就闪烁
                } else {
                    return val[2] / 10 * symbolSize * parsent;
                };
            };

            for (var i = 1; i < length; i++) {
                series.push({
                    symbolSize: getSymbolSize
                })
            }
            myMapChart.setOption({
                series: series
            });
        }, 30);
    }
    bubbleBlur()

    return {
        map: myMapChart,
        bubbleBlur: bubbleBlur
    };
}

registNanquMap()